W4D5/music_app/app/controllers/application_controller.rb

  def current_user  # uses lazy assignment, find user by current session_token
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "ylm0OVMbZDm7Myd_pIqG3A"], ["LIMIT", 1]]