W4D5/music_app/app/controllers/users_controller.rb

  def create # make a new user, if the user is valid, login & redirect to main page
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("password_digest", "session_token", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"